//
//  LGKnowledgeVersion.h
//  LGKnowledgeFramework
//  版本信息

/** 2.1.4（2020-7-30）
   1、常用表达知识点：句法解析->用法解析
   2、发音训练：无训练数据时直接隐藏
   3、知识点弹窗隐藏关闭按钮
*/

/** 2.1.3（2020-7-21）
   1、添加横屏显示参数
*/

/** 2.1.2（2020-7-16）
   1、口语翻译修改翻译错误提示语
*/

/** 2.1.1（2020-7-15）
   1、句法知识点取消自动播放音频
   2、情景对话改为情景朗读
   3、口语翻译优化训练流程
*/

/** 2.1.0（2020-6-19）
   1、适配专业化过关训练加入单词本的需求
*/

/** 2.0.8（2020-6-9）
   1、修复考辅测试问题
*/

/** 2.0.7（2020-5-29）
   1、适配v5.6的资源
   2、增加查询功能
*/

/** 2.0.4（2020-5-18）
   1、优化内测问题
*/

/** 2.0.3（2020-4-17）
   1、优化0415内测问题
*/


/** 2.0.2（2020-2-25）
    1、优化第二次内测问题
 */

/** 2.0.1（2020-2-20）
    1、优化第一次内测问题
 */

/** 2.0.0（2020-2-20）
    1、版本升级首次发布
 */



