//
//  LGKnowledgeVersion.h
//  LGKnowledgeFramework
//  版本信息

/** 1.0(14) - 2019-06-12
 1、导航栏适配iPad
 */

/** 1.0(13) - 2019-05-30
 1、优化initEngine方法
 */


/** 1.0(13) - 2019-05-23
 1、优化网络监听
 */

/** 1.0(12) - 2019-05-15
 1、添加段落评测
 */

/** 1.0(11) - 2019-04-28
 1、优化内外网检测
 */

/** 1.0(10) - 2019-04-13
 1、修改暂停的提示语
 */

/** 1.0(9) - 2019-04-08
 1、知识点卡片：适配ESP知识点
 */


/** 1.0(8) - 2019-03-30
 1、朗读拼写环节：字母颜色区分正确
 */

/** 1.0(7) - 2019-03-29
 1、发音训练结果页面：点击喇叭后关闭倒计时
 2、取消语音评测时：关闭提示框[LGAlert hide]
 */

/** 1.0(6) - 2019-03-27
 1、语音评测：最少分贝改为20db
 */

/** 1.0(5) - 2019-03-22
 1、知识点卡片：单词进入页面，删除自动播放美式发音的功能
 */

/** 1.0(4) - 2019-03-21
 1、知识点卡片：单词进入页面，自动播放美式发音
 2、用法训练：优化专有名词脏数据的加载判断
 3、配置：添加只开放知识点卡片属性 onlyKlgCark
 */
